## Instructions
In this lab we will find the customers who were active in consecutive months of May and June. Follow the steps to complete the analysis.

1. Create a table rentals_may to store the data from rental table with information for the month of May.

2. Insert values in the table rentals_may using the table rental, filtering values only for the month of May.

3. Create a table rentals_june to store the data from rental table with information for the month of June.

4. Insert values in the table rentals_june using the table rental, filtering values only for the month of June.

5. Check the number of rentals for each customer for May.

6. Check the number of rentals for each customer for June.

7. Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

8. Check the number of rentals for each customer for May

9. Check the number of rentals for each customer for June

Hint: You can store the results from the two queries in two separate dataframes.

10. Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.

In [81]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # to get the password without showing the input
password = getpass.getpass()

connection_string = 'mysql+pymysql://root:' + password + '@127.0.0.1/sakila'
engine = create_engine(connection_string)

········

In [82]:
# Getting the data:
query = '''SELECT * FROM rental;'''

df = pd.read_sql_query(query, engine)
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

In [83]:
df['rental_date'] = pd.to_datetime(df['rental_date'])


1. Create a table rentals_may to store the data from rental table with information for the month of May.

2. Insert values in the table rentals_may using the table rental, filtering values only for the month of May.

3. Create a table rentals_june to store the data from rental table with information for the month of June.

4. Insert values in the table rentals_june using the table rental, filtering values only for the month of June.

In [84]:
df['rental_month'] = df['rental_date'].dt.month
rentals_may = df[df['rental_month'] == 5]
rentals_june = df[df['rental_month'] == 6]

8. Check the number of rentals for each customer for May

9. Check the number of rentals for each customer for June

In [85]:
print('Total Rentals May: ',rentals_may.count().rental_id)
print('Total Rentals June: ',rentals_june.count().rental_id)

Total Rentals May:  1156
Total Rentals June:  2311

10. Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [86]:
rentals_may_june = df[(df['rental_month'] == 5) | (df['rental_month'] == 6)]

In [87]:
rentals_may_june.groupby('rental_month')['rental_id'].count().reset_index().rename(columns={'rental_id':'count'})

   rental_month  count
0             5   1156
1             6   2311

In [88]:
def rentals_check(customer_id):
    personal_df = rentals_may_june[rentals_may_june['customer_id'] == customer_id]
    personal_df_count = personal_df.groupby('rental_month')['customer_id'].count().reset_index().rename(columns={'customer_id':'count'})
    may_rental = personal_df_count[personal_df_count['rental_month'] == 5]['count'].sum()
    june_rental = personal_df_count[personal_df_count['rental_month'] == 6]['count'].sum()
    print("Customer_id:", customer_id)
    print("May Total:", may_rental)
    print("June Total:", june_rental)
    if may_rental > june_rental:
        print((may_rental-june_rental),"more films rented in May")
    elif may_rental < june_rental:
        print((june_rental-may_rental),"more films rented in June")
    else:
        print("Equal number of films rented in May and June")

    

# intpu customer_id
rentals_check(40)

Customer_id: 40
May Total: 1
June Total: 4
3 more films rented in June